salara1960/stm32f103_ssd1306_bmp280/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "ssd1306.h"
#include "bmp280.h"
#include "ws2812.h"

#include "stm32f1xx_hal.h"
/*
post-build steps command:
arm-none-eabi-objcopy -O binary "${BuildArtifactFileBaseName}.elf" "${BuildArtifactFileBaseName}.bin" && ls -la | grep "${BuildArtifactFileBaseName}.*"
*/

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

//const char *ver = "ver. 0.1";
//const char *ver = "ver. 1.1";//02.04.2019
//const char *ver = "ver. 1.2";//02.04.2019
//const char *ver = "ver. 1.3";//03.04.2019
//const char *ver = "ver. 1.4";//05.04.2019
//const char *ver = "ver. 1.5";//05.04.2019 put user code in corresponding block
//const char *ver = "ver. 1.6";//06.04.2019 used TIM2 (1 sec. period) with interrupt
//const char *ver = "ver. 1.7";//07.04.2019 used ADC1 with interrupt for measure the supply voltage
//const char *ver = "ver. 1.8";//09.04.2019 used DMA for trasmit data to usart1 (500000 8N1)
//const char *ver = "ver. 1.9";//10.04.2019 used interrupt for receive data from uart1 (echo mode)
//const char *ver = "ver. 2.0";//11.04.2019 set date in RTC from GMT epoch time using uart1 (for example : date=1554977111)
const char *ver = "ver. 2.1";//11.04.2019 add WS2812 (used tim2 with dma1_channel7 -> pin PA1)


/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;

I2C_HandleTypeDef hi2c2;

RTC_HandleTypeDef hrtc;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
DMA_HandleTypeDef hdma_tim2_ch2_ch4;

UART_HandleTypeDef huart1;
DMA_HandleTypeDef hdma_usart1_tx;

/* USER CODE BEGIN PV */

HAL_StatusTypeDef i2cError = HAL_OK;
const uint32_t min_wait_ms = 350;
const uint32_t max_wait_ms = 1000;
result_t sensors = {0.0, 0.0, 0.0};
volatile static uint32_t secCounter = 0;
volatile static uint64_t QuartaSecCounter = 0;
volatile static float dataADC = 0.0;

const char *_extDate = "date=";
volatile static uint32_t extDate = 0;
static bool setDate = false;
static char RxBuf[MAX_UART_BUF];
volatile uint8_t rx_uk;
volatile uint8_t uRxByte = 0;
//static uint32_t TxLine = 0;

uint8_t GoTxDMA = 0;

const rgb_t ws2812_const[] =
{
RGB_SET(L64,   0,   0),
RGB_SET(0,   L64,   0),
RGB_SET(0,     0, L64),
RGB_SET(L64, L64,   0),
RGB_SET(0,   L64, L64),
RGB_SET(L64,   0, L64),
RGB_SET(L64, L64, L64),
RGB_SET(L32,   0,   0)
};


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_I2C2_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM2_Init(void);
static void MX_ADC1_Init(void);
static void MX_RTC_Init(void);
static void MX_TIM1_Init(void);
/* USER CODE BEGIN PFP */

uint32_t get_secCounter();
char *sec_to_string(uint32_t sec);
void Report(const char *txt, bool addCRLF, bool addTime);
void errLedOn(const char *from);
uint32_t get_tmr(uint32_t sec);
bool check_tmr(uint32_t sec);

uint64_t get_hstmr(uint64_t sec);
bool check_hstmr(uint64_t sec);


/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_I2C2_Init();
  MX_USART1_UART_Init();
  MX_TIM2_Init();
  MX_ADC1_Init();
  MX_RTC_Init();
  MX_TIM1_Init();
  /* USER CODE BEGIN 2 */


    HAL_GPIO_WritePin(GPIOB, LED1_Pin | LED_ERROR, GPIO_PIN_SET);//LEDs OFF

    // start timer1 + interrupt
    HAL_TIM_Base_Start(&htim1);
    HAL_TIM_Base_Start_IT(&htim1);
    //start ADC1 + interrupt
    HAL_ADC_Start_IT(&hadc1);
    //"start" rx_interrupt
    HAL_UART_Receive_IT(&huart1, (uint8_t *)&uRxByte, 1);

    HAL_Delay(1000);

    ssd1306_on(true);//screen ON
    if (!i2cError) {
    	ssd1306_init();//screen INIT
    	if (!i2cError) {
    		ssd1306_pattern();//set any params for screen
    		if (!i2cError) {
    			//ssd1306_invert();//set inverse color mode
    			//if (!i2cError)
    				ssd1306_clear();//clear screen
    		}
    	}
    }

    HAL_Delay(1000);

