salara1960/stm32f103_ssd1306_bmp280/Src/main.c
    char stx[256] = {0};
    char toScreen[128] = {0};

    sprintf(stx, "Start main %s", ver);
    Report(stx, true, true);//send data to UART1

    // variable declaration for BMP280 sensor
    uint8_t data_rdx[256] = {0};
    uint8_t reg_id   = 0;
    uint8_t reg_stat = 0;
    uint8_t reg_mode = 0;
    uint8_t reg_conf = 0;
    size_t d_size    = 1;
    int32_t temp, pres, humi = 0;
    char sensorType[32] = {0};

    //for WS2812 : tim2_channel2 + dma1_channel7
    uint8_t scenaINDEX = 1;//ZERO_DOWN;
    bool new_scena = false;
    const dir_mode_t scena[] =
    {
    	COLOR_ALL,
    	ZERO_DOWN,
    	COLOR_ALL,
    	ZERO_UP
    };
    const uint8_t maxSCENA = sizeof(scena);

    uint8_t cnt_off_led = LEN_12;
    dir_mode_t ledMode = scena[scenaINDEX];
    volatile static rgb_t ws2812_arr[LEN_12];
    memcpy((uint8_t *)&ws2812_arr, (uint8_t *)&ws2812_const, sizeof(ws2812_arr));
    ws2812_init();
    ws2812_setData((void *)&ws2812_arr);
    ws2812_start();


  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

    uint32_t wait_sensor = get_tmr(2);//set wait time to 2 sec.

    uint64_t wait_pwm = get_hstmr(2);//1 sec

  while (1) {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */

	  	if (check_hstmr(wait_pwm) && !GoTxDMA) {
	  		switch (ledMode) {
	  			case ZERO_DOWN :
	  				if (cnt_off_led) {
	  					ws2812_arr[cnt_off_led - 1] = RGB_SET(0,0,0);
	  					cnt_off_led--;
	  				} else {
	  					memcpy((uint8_t *)&ws2812_arr, (uint8_t *)&ws2812_const, sizeof(ws2812_arr));
	  					new_scena = true;
	  				}
	  			break;
	  			case ZERO_UP :
	  				if (cnt_off_led < LEN_12) {
	  					ws2812_arr[cnt_off_led] = RGB_SET(0,0,0);
	  					cnt_off_led++;
	  				} else {
	  					memcpy((uint8_t *)&ws2812_arr, (uint8_t *)&ws2812_const, sizeof(ws2812_arr));
	  					new_scena = true;
	  				}
	  			break;
	  			case COLOR_ALL :
	  				memcpy((uint8_t *)&ws2812_arr, (uint8_t *)&ws2812_const, sizeof(ws2812_arr));
	  				new_scena = true;
	  			break;
	  		}
	  		if (new_scena) {
	  			new_scena = false;
	  			scenaINDEX++; if (scenaINDEX >= maxSCENA) scenaINDEX = 0;
	  			ledMode = scena[scenaINDEX];
	  		}
	  		ws2812_setData((void *)&ws2812_arr);
	  		ws2812_start();
	  		wait_pwm = get_hstmr(1);//0.5 sec
	  	}

    	HAL_Delay(10);

    	//------------------------------------------------------------------------

    	if (check_tmr(wait_sensor)) {
    		//
    		wait_sensor = get_tmr(wait_sensor_def);
    		//
    		if (i2c_master_reset_sensor(&reg_id) != HAL_OK) continue;
    		sprintf(stx,"Vcc=%.3f v, ADDR=0x%02X ", dataADC, BMP280_ADDR);
    		sensorType[0] = 0;
    		switch (reg_id) {
    			case BMP280_SENSOR : strcpy(sensorType,"BMP280"); d_size = 6; break;
    			case BME280_SENSOR : strcpy(sensorType,"BME280"); d_size = 8; break;
    				default : strcpy(sensorType,"Unknown chip");
    		}
    		sprintf(stx+strlen(stx),"(%s)", sensorType);
    		if (i2c_master_test_sensor(&reg_stat, &reg_mode, &reg_conf, reg_id) != HAL_OK) {
    			sprintf(stx+strlen(stx)," No ack...try again. (reg_id=0x%02x)", reg_id);
    			Report(stx, true, true);//send data to UART1
    			continue;
    		}
    		reg_stat &= 0x0f;
    		memset(data_rdx, 0, DATA_LENGTH);
    		if (i2c_master_read_sensor(BMP280_REG_PRESSURE, &data_rdx[0], d_size) == HAL_OK) {
    			if (bmp280_readCalibrationData(reg_id) != HAL_OK) {
    				sprintf(stx+strlen(stx)," Reading Calibration Data ERROR");
    			} else {
    				pres = temp = 0;
    				pres = (data_rdx[0] << 12) | (data_rdx[1] << 4) | (data_rdx[2] >> 4);
    				temp = (data_rdx[3] << 12) | (data_rdx[4] << 4) | (data_rdx[5] >> 4);
    				if (reg_id == BME280_SENSOR) humi = (data_rdx[6] << 8) | data_rdx[7];
    				bmp280_CalcAll(&sensors, reg_id, temp, pres, humi);
    				sprintf(stx+strlen(stx)," Press=%.2f mmHg, Temp=%.2f DegC", sensors.pres, sensors.temp);
    				if (reg_id == BME280_SENSOR) sprintf(stx+strlen(stx)," Humidity=%.2f %%rH", sensors.humi);

    				if (i2cError == HAL_OK) {
    					sprintf(toScreen, "mmHg : %.2f\nDegC : %.2f", sensors.pres, sensors.temp);
    					if (reg_id == BME280_SENSOR) sprintf(toScreen+strlen(toScreen),"\nHumi:%.2f %%rH", sensors.humi);
    					ssd1306_text_xy(toScreen, 1, 6);//send string to screen
    				}

    			}
    		} else strcat(stx,"Read sensor error");
    		Report(stx, true, true);//send data to UART1
    		//
    	}

    	//------------------------------------------------------------------------

  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

  /** Initializes the CPU, AHB and APB busses clocks 
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE|RCC_OSCILLATORTYPE_LSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.LSEState = RCC_LSE_ON;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /** Initializes the CPU, AHB and APB busses clocks 
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV8;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_RTC|RCC_PERIPHCLK_ADC;
  PeriphClkInit.RTCClockSelection = RCC_RTCCLKSOURCE_LSE;
  PeriphClkInit.AdcClockSelection = RCC_ADCPCLK2_DIV8;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief ADC1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_ADC1_Init(void)
{

  /* USER CODE BEGIN ADC1_Init 0 */

