salara1960/stm32f103_ssd1306_bmp280/Src/main.c
}

/** 
  * Enable DMA controller clock
  */
static void MX_DMA_Init(void) 
{
  /* DMA controller clock enable */
  __HAL_RCC_DMA1_CLK_ENABLE();

  /* DMA interrupt init */
  /* DMA1_Channel4_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Channel4_IRQn, 3, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel4_IRQn);
  /* DMA1_Channel7_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Channel7_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel7_IRQn);

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, LED1_Pin|LED2_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pins : LED1_Pin LED2_Pin */
  GPIO_InitStruct.Pin = LED1_Pin|LED2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
void set_Date(time_t epoch)
{
RTC_TimeTypeDef sTime;
RTC_DateTypeDef sDate;
struct tm ts;

	gmtime_r(&epoch, &ts);

	sDate.WeekDay = ts.tm_wday;
	sDate.Month = ts.tm_mon + 1;
	sDate.Date = ts.tm_mday;
	sDate.Year = ts.tm_year;
	if (HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BIN) != HAL_OK) errLedOn(__func__);
	else {
		sTime.Hours = ts.tm_hour;
		sTime.Minutes = ts.tm_min;
		sTime.Seconds = ts.tm_sec;
		if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN) != HAL_OK) errLedOn(__func__);
		else {
			setDate = true;
		}
	}
}
//-----------------------------------------------------------------------------
int sec_to_str_time(uint32_t sec, char *stx)
{
uint32_t s = sec;

	uint32_t day = s / (60 * 60 * 24);
	s %= (60 * 60 * 24);

    uint32_t hour = s / (60 * 60);
    s %= (60 * 60);

    uint32_t min = s / (60);
    s %= 60;

    return (sprintf(stx, "%lu.%02lu:%02lu:%02lu", day, hour, min, s));
}
//-----------------------------------------------------------------------------
uint32_t get_secCounter()
{
	return secCounter;
}
//-----------------------------------------------------------------------------
void inc_secCounter()
{
	secCounter++;
}
//-----------------------------------------------------------------------------
uint64_t get_hsCounter()
{
	return QuartaSecCounter;
}
//-----------------------------------------------------------------------------
void inc_hsCounter()
{
	QuartaSecCounter++;
}
//----------------------------------------------------------------------------------------
//  if (return pointer != NULL) you must free this pointer after used
char *sec_to_string(uint32_t sec)
{
	char *stx = (char *)calloc(1, 32);
	if (stx) {
		if (!setDate) {//no valid date in RTC
			uint32_t day = sec / (60 * 60 * 24);
			sec %= (60 * 60 * 24);
			uint32_t hour = sec / (60 * 60);
			sec %= (60 * 60);
			uint32_t min = sec / (60);
			sec %= 60;
			sprintf(stx, "%03lu.%02lu:%02lu:%02lu", day, hour, min, sec);
		} else {//in RTC valid date (epoch time)
			RTC_TimeTypeDef sTime;
			RTC_DateTypeDef sDate;
			if (HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN) != HAL_OK) errLedOn(__func__);
			else {
				if (HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN) != HAL_OK) errLedOn(__func__);
				else {
					sprintf(stx,"%04u.%02u.%02u %02u:%02u:%02u",
							sDate.Year + 1900, sDate.Month, sDate.Date,
							sTime.Hours, sTime.Minutes, sTime.Seconds);
				}
			}
		}
	}

    return stx;
}
//----------------------------------------------------------------------------------------
//	Out to UART1 data from buffer (like printf)
//     txt - string for send to uart
//     addCRLF - flag append or not "\r\n" to data before sending
//     addTime - flag insert or not TickCount before data
void Report(const char *txt, bool addCRLF, bool addTime)
{
	if (!txt)  return;

	uint16_t len = strlen(txt);
	if (addCRLF) len += 2;
	if (addTime) len += 32;
	char *buf = (char *)calloc(1, len + 1);//get buffer for data in heap memory
	if (!buf) return;

	if (addTime) {
		uint32_t ep;
		if (!setDate) ep = get_secCounter();
				 else ep = extDate;
		char *stime = sec_to_string(ep);
		if (stime) {
			strcpy(buf, stime);
			strcat(buf, " | ");
			free(stime);//release memory by pointer stime
		}
	}
	strcat(buf, txt);
	if (addCRLF) strcat(buf, "\r\n");
	len = strlen(buf);

	// send data to UART1 via DMA1_Channel4
	if (HAL_UART_Transmit_DMA(&huart1, (uint8_t *)buf, len) != HAL_OK) errLedOn(NULL);

	free(buf);

}
//------------------------------------------------------------------------------------------
// set LED_ERROR when error on and send message to UART1 (in from != NULL)
//     from - name of function where error location
void errLedOn(const char *from)
{
	HAL_GPIO_WritePin(GPIOB, LED_ERROR, GPIO_PIN_RESET);//LED ON
	HAL_Delay(200);
	HAL_GPIO_WritePin(GPIOB, LED_ERROR, GPIO_PIN_SET);//LED OFF
	HAL_Delay(200);
	HAL_GPIO_WritePin(GPIOB, LED_ERROR, GPIO_PIN_RESET);//LED ON

	if (from) {
		char *stx = (char *)calloc(1, strlen(from) + 16);
		if (stx) {
			sprintf(stx, "Error in '%s'", from);
			Report(stx, true, true);
			free(stx);
		}
	}
}
//------------------------------------------------------------------------------------------
uint32_t get_tmr(uint32_t sec)
{
	return (get_secCounter() + sec);
}
//------------------------------------------------------------------------------------------
bool check_tmr(uint32_t sec)
{
	return (get_secCounter() >= sec ? true : false);
}
//------------------------------------------------------------------------------------------
uint64_t get_hstmr(uint64_t hs)
{
	return (get_hsCounter() + hs);
}
//------------------------------------------------------------------------------------------
bool check_hstmr(uint64_t hs)
{
	return (get_hsCounter() >= hs ? true : false);
}
//------------------------------------------------------------------------------------------
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc)
{
	if (hadc->Instance == ADC1) {
		dataADC = ((float)HAL_ADC_GetValue(hadc)) * 3.3 / 4096;
	}
}
//------------------------------------------------------------------------------------------
/*
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
	if (huart->Instance == USART1) {
		TxLine++;
		char stx[16];
		ssd1306_calcx(sprintf(stx, "- %lu -", TxLine));
		ssd1306_text_xy(stx, ssd1306_calcx(sprintf(stx, "- %lu -", TxLine)), 1);
	}
}
*/
//------------------------------------------------------------------------------------------
/*
void HAL_RTCEx_RTCEventCallback(RTC_HandleTypeDef *hrtc)
{
	if (hrtc->Instance == RTC) {
		inc_secCounter();
		HAL_GPIO_TogglePin(GPIOB, LED1_Pin);//set ON/OFF LED1
		if (!i2cError) {
			char buf[64];
			uint8_t col = ssd1306_calcx(sec_to_str_time(get_secCounter(), buf));
			sprintf(buf+strlen(buf), "\n\nvolt : %.3f", dataADC);
			ssd1306_text_xy(buf, col, 2);
		}
	}
}
*/
//------------------------------------------------------------------------------------------
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	if (huart->Instance == USART1) {
		RxBuf[rx_uk & 0xff] = (char)uRxByte;
		if ((uRxByte == 0x0a) || (uRxByte == 0x0d)) {//end of line
			char *uk = strstr(RxBuf, _extDate);//const char *_extDate = "date=";
			if (uk) {
				uk += strlen(_extDate);
				if (*uk != '?') {
					if (strlen(uk) < 10) setDate = false;
					else {
						extDate = atoi(uk);
						sprintf(RxBuf, "%s:%lu\r\n", _extDate, extDate);
						set_Date((time_t)extDate);
					}
				} else setDate = true;
			}
			Report(RxBuf, false, false);
			memset(RxBuf, 0, MAX_UART_BUF);
			rx_uk = 0;
		} else rx_uk++;

		HAL_UART_Receive_IT(huart, (uint8_t *)&uRxByte, 1);

